[Killed] ArithmeticOperator
src/calculadora.ts:43:12
    * @returns {number} La suma de los dos números.
    */
   sumar(a: number, b: number): number {
-    return a + b;
+    return a - b;
   }
 
killedBy: Calculadora should sum two numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: -1

[Killed] ArithmeticOperator
src/calculadora.ts:53:12
    * @returns {number} La resta de los dos números.
    */
   restar(a: number, b: number): number {
-    return a - b;
+    return a + b;
   }
 
killedBy: Calculadora should subtract two numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 8

[Killed] ArithmeticOperator
src/calculadora.ts:63:12
    * @returns {number} El producto de los dos números.
    */
   multiplicar(a: number, b: number): number {
-    return a * b;
+    return a / b;
   }
 
killedBy: Calculadora should multiply two numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 0.8

[Killed] EqualityOperator
src/calculadora.ts:74:9
    * @throws {Error} Si el denominador es cero.
    */
   dividir(a: number, b: number): number {
-    if (b === 0) {
+    if (b !== 0) {
       throw new Error("No se puede dividir por cero");
     }
killedBy: Calculadora should throw an error when dividing by zero
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "No se puede dividir por cero"

Received function did not throw

[Killed] BlockStatement
src/calculadora.ts:74:18
    * @throws {Error} Si el denominador es cero.
    */
   dividir(a: number, b: number): number {
-    if (b === 0) {
-      throw new Error("No se puede dividir por cero");
-    }
+    if (b === 0) {}
     return a / b;
   }
killedBy: Calculadora should throw an error when dividing by zero
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "No se puede dividir por cero"

Received function did not throw

[Killed] EqualityOperator
src/calculadora.ts:98:9
    * @throws {Error} Si el número es negativo, se lanza un error indicando que no se puede calcular la raíz cuadrada de un número negativo.
    */
   raizCuadrada(numero: number): number {
-    if (numero < 0) {
+    if (numero >= 0) {
       throw new Error(
         "No se puede calcular la raíz cuadrada de un número negativo"
killedBy: Calculadora should calculate the square root of a number
statusReason: Error: No se puede calcular la raíz cuadrada de un número negativo

[Killed] ConditionalExpression
src/calculadora.ts:98:9
    * @throws {Error} Si el número es negativo, se lanza un error indicando que no se puede calcular la raíz cuadrada de un número negativo.
    */
   raizCuadrada(numero: number): number {
-    if (numero < 0) {
+    if (true) {
       throw new Error(
         "No se puede calcular la raíz cuadrada de un número negativo"
killedBy: Calculadora should calculate the square root of a number
statusReason: Error: No se puede calcular la raíz cuadrada de un número negativo

[NoCoverage] ArithmeticOperator
src/calculadora.ts:114:12
    * @returns El resto de la división de `a` por `b`.
    */
   modulo(a: number, b: number): number {
-    return a % b;
+    return a * b;
   }
 
