[Killed] BlockStatement
src/lib/generate-passwd.ts:39:69
   randomFn: () => number
 ): string {
   // Validate integer lengths
-  if (!Number.isInteger(minLength) || !Number.isInteger(maxLength)) {
-    throw new Error("Las longitudes deben ser enteros.");
-  }
+  if (!Number.isInteger(minLength) || !Number.isInteger(maxLength)) {}
   if (minLength < 0 || maxLength < 0) {
     throw new Error("Las longitudes deben ser enteros no negativos.");
killedBy: generatePasswordFromRandom - tests exhaustivos debe lanzar error si las longitudes no son enteros
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Las longitudes deben ser enteros."

Received function did not throw

[Killed] ConditionalExpression
src/lib/generate-passwd.ts:39:7
   randomFn: () => number
 ): string {
   // Validate integer lengths
-  if (!Number.isInteger(minLength) || !Number.isInteger(maxLength)) {
+  if (true) {
     throw new Error("Las longitudes deben ser enteros.");
   }
killedBy: generatePassword debería generar una contraseña con la longitud especificada
statusReason: Error: Las longitudes deben ser enteros.

[Killed] EqualityOperator
src/lib/generate-passwd.ts:42:24
   if (!Number.isInteger(minLength) || !Number.isInteger(maxLength)) {
     throw new Error("Las longitudes deben ser enteros.");
   }
-  if (minLength < 0 || maxLength < 0) {
+  if (minLength < 0 || maxLength >= 0) {
     throw new Error("Las longitudes deben ser enteros no negativos.");
   }
killedBy: generatePasswordFromRandom - tests exhaustivos debe generar contraseña cuando min == max (longitud fija)
statusReason: Error: Las longitudes deben ser enteros no negativos.

[Killed] EqualityOperator
src/lib/generate-passwd.ts:42:7
   if (!Number.isInteger(minLength) || !Number.isInteger(maxLength)) {
     throw new Error("Las longitudes deben ser enteros.");
   }
-  if (minLength < 0 || maxLength < 0) {
+  if (minLength >= 0 || maxLength < 0) {
     throw new Error("Las longitudes deben ser enteros no negativos.");
   }
killedBy: generatePasswordFromRandom - tests exhaustivos debe generar contraseña cuando min == max (longitud fija)
statusReason: Error: Las longitudes deben ser enteros no negativos.

[Killed] ConditionalExpression
src/lib/generate-passwd.ts:45:7
   if (minLength < 0 || maxLength < 0) {
     throw new Error("Las longitudes deben ser enteros no negativos.");
   }
-  if (minLength > maxLength) {
+  if (false) {
     throw new Error("La longitud mínima no puede ser mayor que la longitud máxima.");
   }
killedBy: generatePassword debería lanzar un error si la longitud mínima es mayor que la longitud máxima
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "La longitud mínima no puede ser mayor que la longitud máxima."

Received function did not throw

[Killed] BlockStatement
src/lib/generate-passwd.ts:45:30
   if (minLength < 0 || maxLength < 0) {
     throw new Error("Las longitudes deben ser enteros no negativos.");
   }
-  if (minLength > maxLength) {
-    throw new Error("La longitud mínima no puede ser mayor que la longitud máxima.");
-  }
+  if (minLength > maxLength) {}
 
   if (!useUppercase && !useLowercase && !useNumbers && !useSymbols && !customSymbols) {
killedBy: generatePassword debería lanzar un error si la longitud mínima es mayor que la longitud máxima
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "La longitud mínima no puede ser mayor que la longitud máxima."

Received function did not throw

[Killed] LogicalOperator
src/lib/generate-passwd.ts:49:7
     throw new Error("La longitud mínima no puede ser mayor que la longitud máxima.");
   }
 
-  if (!useUppercase && !useLowercase && !useNumbers && !useSymbols && !customSymbols) {
+  if (!useUppercase || !useLowercase && !useNumbers && !useSymbols && !customSymbols) {
     throw new Error("Debe seleccionar al menos una opción de caracteres.");
   }
killedBy: generatePassword debería incluir letras mayúsculas si se selecciona la opción
statusReason: Error: Debe seleccionar al menos una opción de caracteres.

[Killed] BlockStatement
src/lib/generate-passwd.ts:49:87
     throw new Error("La longitud mínima no puede ser mayor que la longitud máxima.");
   }
 
-  if (!useUppercase && !useLowercase && !useNumbers && !useSymbols && !customSymbols) {
-    throw new Error("Debe seleccionar al menos una opción de caracteres.");
-  }
+  if (!useUppercase && !useLowercase && !useNumbers && !useSymbols && !customSymbols) {}
 
   const uppercaseChars = "ABCDEFGHIJKLMNOPQRSTUVWXYZ";
killedBy: generatePassword debería lanzar un error si no se selecciona ninguna opción de caracteres
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Debe seleccionar al menos una opción de caracteres."

Received function did not throw

[Killed] StringLiteral
src/lib/generate-passwd.ts:53:26
     throw new Error("Debe seleccionar al menos una opción de caracteres.");
   }
 
-  const uppercaseChars = "ABCDEFGHIJKLMNOPQRSTUVWXYZ";
+  const uppercaseChars = "";
   const lowercaseChars = "abcdefghijklmnopqrstuvwxyz";
   const numberChars = "0123456789";
killedBy: generatePassword debería incluir letras mayúsculas si se selecciona la opción
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] StringLiteral
src/lib/generate-passwd.ts:54:26
   }
 
   const uppercaseChars = "ABCDEFGHIJKLMNOPQRSTUVWXYZ";
-  const lowercaseChars = "abcdefghijklmnopqrstuvwxyz";
+  const lowercaseChars = "";
   const numberChars = "0123456789";
   const defaultSymbols = "!@#$%^&*()_+[]{}|;:,.<>?";

[Killed] LogicalOperator
src/lib/generate-passwd.ts:57:19
   const lowercaseChars = "abcdefghijklmnopqrstuvwxyz";
   const numberChars = "0123456789";
   const defaultSymbols = "!@#$%^&*()_+[]{}|;:,.<>?";
-  const symbols = customSymbols || defaultSymbols;
+  const symbols = customSymbols && defaultSymbols;
 
   let allChars = "";
killedBy: generatePassword debería incluir símbolos si se selecciona la opción
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/lib/generate-passwd.ts:57:19
   const lowercaseChars = "abcdefghijklmnopqrstuvwxyz";
   const numberChars = "0123456789";
   const defaultSymbols = "!@#$%^&*()_+[]{}|;:,.<>?";
-  const symbols = customSymbols || defaultSymbols;
+  const symbols = false;
 
   let allChars = "";
killedBy: generatePassword debería incluir símbolos si se selecciona la opción
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] StringLiteral
src/lib/generate-passwd.ts:59:18
   const defaultSymbols = "!@#$%^&*()_+[]{}|;:,.<>?";
   const symbols = customSymbols || defaultSymbols;
 
-  let allChars = "";
+  let allChars = "Stryker was here!";
   if (useUppercase) allChars += uppercaseChars;
   if (useLowercase) allChars += lowercaseChars;

[Killed] ConditionalExpression
src/lib/generate-passwd.ts:60:7
   const symbols = customSymbols || defaultSymbols;
 
   let allChars = "";
-  if (useUppercase) allChars += uppercaseChars;
+  if (true) allChars += uppercaseChars;
   if (useLowercase) allChars += lowercaseChars;
   if (useNumbers) allChars += numberChars;
killedBy: generatePassword debería utilizar los símbolos personalizados si se proporcionan
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/lib/generate-passwd.ts:60:7
   const symbols = customSymbols || defaultSymbols;
 
   let allChars = "";
-  if (useUppercase) allChars += uppercaseChars;
+  if (false) allChars += uppercaseChars;
   if (useLowercase) allChars += lowercaseChars;
   if (useNumbers) allChars += numberChars;
killedBy: generatePassword debería incluir letras mayúsculas si se selecciona la opción
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/lib/generate-passwd.ts:61:7
 
   let allChars = "";
   if (useUppercase) allChars += uppercaseChars;
-  if (useLowercase) allChars += lowercaseChars;
+  if (true) allChars += lowercaseChars;
   if (useNumbers) allChars += numberChars;
   if (useSymbols || customSymbols) allChars += symbols;
killedBy: generatePassword debería incluir números si se selecciona la opción
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ConditionalExpression
src/lib/generate-passwd.ts:61:7
 
   let allChars = "";
   if (useUppercase) allChars += uppercaseChars;
-  if (useLowercase) allChars += lowercaseChars;
+  if (false) allChars += lowercaseChars;
   if (useNumbers) allChars += numberChars;
   if (useSymbols || customSymbols) allChars += symbols;

[Killed] ConditionalExpression
src/lib/generate-passwd.ts:62:7
   let allChars = "";
   if (useUppercase) allChars += uppercaseChars;
   if (useLowercase) allChars += lowercaseChars;
-  if (useNumbers) allChars += numberChars;
+  if (false) allChars += numberChars;
   if (useSymbols || customSymbols) allChars += symbols;
 
killedBy: generatePassword debería incluir números si se selecciona la opción
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ConditionalExpression
src/lib/generate-passwd.ts:62:7
   let allChars = "";
   if (useUppercase) allChars += uppercaseChars;
   if (useLowercase) allChars += lowercaseChars;
-  if (useNumbers) allChars += numberChars;
+  if (true) allChars += numberChars;
   if (useSymbols || customSymbols) allChars += symbols;
 

[Killed] ConditionalExpression
src/lib/generate-passwd.ts:63:7
   if (useUppercase) allChars += uppercaseChars;
   if (useLowercase) allChars += lowercaseChars;
   if (useNumbers) allChars += numberChars;
-  if (useSymbols || customSymbols) allChars += symbols;
+  if (false) allChars += symbols;
 
   const range = maxLength - minLength + 1;
killedBy: generatePassword debería incluir símbolos si se selecciona la opción
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/lib/generate-passwd.ts:63:7
   if (useUppercase) allChars += uppercaseChars;
   if (useLowercase) allChars += lowercaseChars;
   if (useNumbers) allChars += numberChars;
-  if (useSymbols || customSymbols) allChars += symbols;
+  if (useSymbols && customSymbols) allChars += symbols;
 
   const range = maxLength - minLength + 1;
killedBy: generatePassword debería incluir símbolos si se selecciona la opción
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/lib/generate-passwd.ts:65:17
   if (useNumbers) allChars += numberChars;
   if (useSymbols || customSymbols) allChars += symbols;
 
-  const range = maxLength - minLength + 1;
+  const range = maxLength + minLength + 1;
   const passwordLength = Math.floor(randomFn() * range) + minLength;
   let password = "";
killedBy: generatePasswordFromRandom - tests exhaustivos debe generar contraseña cuando min == max (longitud fija)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 24

[Killed] ArithmeticOperator
src/lib/generate-passwd.ts:65:17
   if (useNumbers) allChars += numberChars;
   if (useSymbols || customSymbols) allChars += symbols;
 
-  const range = maxLength - minLength + 1;
+  const range = maxLength - minLength - 1;
   const passwordLength = Math.floor(randomFn() * range) + minLength;
   let password = "";
killedBy: generatePasswordFromRandom - tests exhaustivos debe generar contraseña cuando min == max (longitud fija)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 11

[Killed] ArithmeticOperator
src/lib/generate-passwd.ts:66:26
   if (useSymbols || customSymbols) allChars += symbols;
 
   const range = maxLength - minLength + 1;
-  const passwordLength = Math.floor(randomFn() * range) + minLength;
+  const passwordLength = Math.floor(randomFn() * range) - minLength;
   let password = "";
 
killedBy: generatePassword debería generar una contraseña con la longitud especificada
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 8
Received:    0

[Survived] ArithmeticOperator
src/lib/generate-passwd.ts:66:37
   if (useSymbols || customSymbols) allChars += symbols;
 
   const range = maxLength - minLength + 1;
-  const passwordLength = Math.floor(randomFn() * range) + minLength;
+  const passwordLength = Math.floor(randomFn() / range) + minLength;
   let password = "";
 

[Killed] BlockStatement
src/lib/generate-passwd.ts:69:44
   const passwordLength = Math.floor(randomFn() * range) + minLength;
   let password = "";
 
-  for (let i = 0; i < passwordLength; i++) {
-    const randomIndex = Math.floor(randomFn() * allChars.length);
-    password += allChars[randomIndex];
-  }
+  for (let i = 0; i < passwordLength; i++) {}
   return password;
 }
killedBy: generatePassword debería generar una contraseña con la longitud especificada
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 8
Received:    0

[Killed] EqualityOperator
src/lib/generate-passwd.ts:69:19
   const passwordLength = Math.floor(randomFn() * range) + minLength;
   let password = "";
 
-  for (let i = 0; i < passwordLength; i++) {
+  for (let i = 0; i <= passwordLength; i++) {
     const randomIndex = Math.floor(randomFn() * allChars.length);
     password += allChars[randomIndex];
killedBy: generatePasswordFromRandom - tests exhaustivos debe generar contraseña cuando min == max (longitud fija)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 13

[Survived] ArithmeticOperator
src/lib/generate-passwd.ts:70:36
   let password = "";
 
   for (let i = 0; i < passwordLength; i++) {
-    const randomIndex = Math.floor(randomFn() * allChars.length);
+    const randomIndex = Math.floor(randomFn() / allChars.length);
     password += allChars[randomIndex];
   }

[Killed] BooleanLiteral
src/lib/generate-passwd.ts:92:39
 ): string {
   // Delegate to crypto-based generator
   // Validate integer lengths
-  if (!Number.isInteger(minLength) || !Number.isInteger(maxLength)) {
+  if (!Number.isInteger(minLength) || Number.isInteger(maxLength)) {
     throw new Error("Las longitudes deben ser enteros.");
   }
killedBy: generatePasswordSecure usa crypto.randomInt para longitud y selección de índices
statusReason: Error: Las longitudes deben ser enteros.

[Killed] BooleanLiteral
src/lib/generate-passwd.ts:92:7
 ): string {
   // Delegate to crypto-based generator
   // Validate integer lengths
-  if (!Number.isInteger(minLength) || !Number.isInteger(maxLength)) {
+  if (Number.isInteger(minLength) || !Number.isInteger(maxLength)) {
     throw new Error("Las longitudes deben ser enteros.");
   }
killedBy: generatePasswordSecure usa crypto.randomInt para longitud y selección de índices
statusReason: Error: Las longitudes deben ser enteros.

[NoCoverage] StringLiteral
src/lib/generate-passwd.ts:93:21
   // Delegate to crypto-based generator
   // Validate integer lengths
   if (!Number.isInteger(minLength) || !Number.isInteger(maxLength)) {
-    throw new Error("Las longitudes deben ser enteros.");
+    throw new Error("");
   }
   if (minLength < 0 || maxLength < 0) {

[Killed] ConditionalExpression
src/lib/generate-passwd.ts:98:7
   if (minLength < 0 || maxLength < 0) {
     throw new Error("Las longitudes deben ser enteros no negativos.");
   }
-  if (minLength > maxLength) {
+  if (true) {
     throw new Error("La longitud mínima no puede ser mayor que la longitud máxima.");
   }
killedBy: generatePasswordSecure usa crypto.randomInt para longitud y selección de índices
statusReason: Error: La longitud mínima no puede ser mayor que la longitud máxima.

[Killed] EqualityOperator
src/lib/generate-passwd.ts:98:7
   if (minLength < 0 || maxLength < 0) {
     throw new Error("Las longitudes deben ser enteros no negativos.");
   }
-  if (minLength > maxLength) {
+  if (minLength <= maxLength) {
     throw new Error("La longitud mínima no puede ser mayor que la longitud máxima.");
   }
killedBy: generatePasswordSecure usa crypto.randomInt para longitud y selección de índices
statusReason: Error: La longitud mínima no puede ser mayor que la longitud máxima.

[NoCoverage] StringLiteral
src/lib/generate-passwd.ts:99:21
     throw new Error("Las longitudes deben ser enteros no negativos.");
   }
   if (minLength > maxLength) {
-    throw new Error("La longitud mínima no puede ser mayor que la longitud máxima.");
+    throw new Error("");
   }
   if (!useUppercase && !useLowercase && !useNumbers && !useSymbols && !customSymbols) {

[Killed] ConditionalExpression
src/lib/generate-passwd.ts:101:7
   if (minLength > maxLength) {
     throw new Error("La longitud mínima no puede ser mayor que la longitud máxima.");
   }
-  if (!useUppercase && !useLowercase && !useNumbers && !useSymbols && !customSymbols) {
+  if (true) {
     throw new Error("Debe seleccionar al menos una opción de caracteres.");
   }
killedBy: generatePasswordSecure usa crypto.randomInt para longitud y selección de índices
statusReason: Error: Debe seleccionar al menos una opción de caracteres.

[Killed] ConditionalExpression
src/lib/generate-passwd.ts:101:7
   if (minLength > maxLength) {
     throw new Error("La longitud mínima no puede ser mayor que la longitud máxima.");
   }
-  if (!useUppercase && !useLowercase && !useNumbers && !useSymbols && !customSymbols) {
+  if (true && !customSymbols) {
     throw new Error("Debe seleccionar al menos una opción de caracteres.");
   }
killedBy: generatePasswordSecure usa crypto.randomInt para longitud y selección de índices
statusReason: Error: Debe seleccionar al menos una opción de caracteres.

[NoCoverage] StringLiteral
src/lib/generate-passwd.ts:102:21
     throw new Error("La longitud mínima no puede ser mayor que la longitud máxima.");
   }
   if (!useUppercase && !useLowercase && !useNumbers && !useSymbols && !customSymbols) {
-    throw new Error("Debe seleccionar al menos una opción de caracteres.");
+    throw new Error("");
   }
 

[Survived] StringLiteral
src/lib/generate-passwd.ts:108:26
   const uppercaseChars = "ABCDEFGHIJKLMNOPQRSTUVWXYZ";
   const lowercaseChars = "abcdefghijklmnopqrstuvwxyz";
   const numberChars = "0123456789";
-  const defaultSymbols = "!@#$%^&*()_+[]{}|;:,.<>?";
+  const defaultSymbols = "";
   const symbols = customSymbols || defaultSymbols;
 

[Survived] ConditionalExpression
src/lib/generate-passwd.ts:109:19
   const lowercaseChars = "abcdefghijklmnopqrstuvwxyz";
   const numberChars = "0123456789";
   const defaultSymbols = "!@#$%^&*()_+[]{}|;:,.<>?";
-  const symbols = customSymbols || defaultSymbols;
+  const symbols = true;
 
   let allChars = "";

[Survived] ConditionalExpression
src/lib/generate-passwd.ts:115:7
   if (useUppercase) allChars += uppercaseChars;
   if (useLowercase) allChars += lowercaseChars;
   if (useNumbers) allChars += numberChars;
-  if (useSymbols || customSymbols) allChars += symbols;
+  if (true) allChars += symbols;
 
   // randomInt(min, max) returns integer in [min, max)

[Survived] ArithmeticOperator
src/lib/generate-passwd.ts:118:54
   if (useSymbols || customSymbols) allChars += symbols;
 
   // randomInt(min, max) returns integer in [min, max)
-  const passwordLength = crypto.randomInt(minLength, maxLength + 1);
+  const passwordLength = crypto.randomInt(minLength, maxLength - 1);
   let password = "";
 

[Killed] ConditionalExpression
src/lib/generate-passwd.ts:121:19
   const passwordLength = crypto.randomInt(minLength, maxLength + 1);
   let password = "";
 
-  for (let i = 0; i < passwordLength; i++) {
+  for (let i = 0; false; i++) {
     const randomIndex = crypto.randomInt(0, allChars.length);
     password += allChars[randomIndex];
killedBy: generatePasswordSecure usa crypto.randomInt para longitud y selección de índices
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 8
Received:    0

[Killed] EqualityOperator
src/lib/generate-passwd.ts:121:19
   const passwordLength = crypto.randomInt(minLength, maxLength + 1);
   let password = "";
 
-  for (let i = 0; i < passwordLength; i++) {
+  for (let i = 0; i >= passwordLength; i++) {
     const randomIndex = crypto.randomInt(0, allChars.length);
     password += allChars[randomIndex];
killedBy: generatePasswordSecure usa crypto.randomInt para longitud y selección de índices
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 8
Received:    0
